import random
rand_num = random.randrange(1, 100)
print("Вгадай випадкове число від 1 до 100")

def number_check(number):
    if number == rand_num:
        return 1
    if number > rand_num:
        return 2
    if number < rand_num:
        return 3


count = 1
while count <= 7:
    if count <= 6:
        number = int(input("Введіть число: "))
        res  = number_check(number)
        if res == 1:
            print(f"Вітаю, Ти виграв! Було використано спроб: {count}")
            break
        if res == 2:
            print("Твоє число більше ніж випадкове ")
        if res == 3:
            print("Твоє число меньше ніж випажкове")
    else:
        print("Ти програв, в тебе закінчилися спроби")
    count += 1




# Спочату задаю змінній rand_num випадкове значення
# Створюю функцію яка перевіряє число на відповідніть
# Сворюю лічильник спроб і зберігаю в змінну count
# Створюю цикл while який працює 7 разів( 6 разів для спроб і один для вивода повідомлення про програш)
# В середені цикла запрошуємо число від користувача і присваюваємо значення в змінну number
# Потім визиваємо функцію перевірки номера number_check і вже порівнюємо вивід і виводимо відповідне повідомлення
# Як що користувач вгадав - цикл зупиняється
# Як що ні - цикл працює до кінця і виводить повідомлення про програш
#



